//============================================================
//
//	ライトヘッダー [light.h]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	二重インクルード防止
//************************************************************
#ifndef _LIGHT_H_
#define _LIGHT_H_

//************************************************************
//	定数宣言
//************************************************************
namespace light
{
	const int MAX_NUM = 4;	// 使用ライト数
}

//************************************************************
//	クラス定義
//************************************************************
// ライトクラス
class CLight
{
public:
	// コンストラクタ
	CLight();

	// デストラクタ
	~CLight();

	// メンバ関数
	HRESULT Init(void);	// 初期化
	void Uninit(void);	// 終了
	void Update(const float fDeltaTime);	// 更新
	D3DLIGHT9 GetLight(const int nID);		// ライト取得

	// 静的メンバ関数
	static CLight *Create(void);			// 生成
	static void Release(CLight *&pLight);	// 破棄

private:
	// メンバ変数
	D3DLIGHT9 m_aLight[light::MAX_NUM];	// ライトの情報
};

#endif	// _LIGHT_H_
