//============================================================
//
//	タイトル画面処理 [sceneTitle.cpp]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	インクルードファイル
//************************************************************
#include "sceneTitle.h"
#include "manager.h"
#include "texture.h"
#include "sound.h"
#include "camera.h"
#include "titleManager.h"

//************************************************************
//	静的メンバ変数宣言
//************************************************************
CTitleManager *CSceneTitle::m_pTitleManager = nullptr;	// タイトルマネージャー

//************************************************************
//	子クラス [CSceneTitle] のメンバ関数
//************************************************************
//============================================================
//	コンストラクタ
//============================================================
CSceneTitle::CSceneTitle(const EMode mode) : CScene(mode)
{

}

//============================================================
//	デストラクタ
//============================================================
CSceneTitle::~CSceneTitle()
{

}

//============================================================
//	初期化処理
//============================================================
HRESULT CSceneTitle::Init(void)
{
	//--------------------------------------------------------
	//	タイトルの初期化
	//--------------------------------------------------------
	// タイトルマネージャーの生成
	m_pTitleManager = CTitleManager::Create();
	if (m_pTitleManager == nullptr)
	{ // 非使用中の場合

		// 失敗を返す
		assert(false);
		return E_FAIL;
	}

	// シーンの初期化
	CScene::Init();

	//--------------------------------------------------------
	//	初期設定
	//--------------------------------------------------------
	// カメラを設定
	CCamera *pCamera = GET_MANAGER->GetCamera();	// カメラ情報
	pCamera->SetState(CCamera::STATE_ROTATE);		// カメラを回転状態に設定
	pCamera->SetDestRotate();						// 目標位置を設定
	pCamera->SetEnableUpdate(false);				// 更新を停止

	// BGMの再生
	PLAY_SOUND(CSound::LABEL_BGM_GENERAL);

	// 成功を返す
	return S_OK;
}

//============================================================
//	終了処理
//============================================================
void CSceneTitle::Uninit(void)
{
	// タイトルマネージャーの破棄
	SAFE_REF_RELEASE(m_pTitleManager);

	// シーンの終了
	CScene::Uninit();
}

//============================================================
//	更新処理
//============================================================
void CSceneTitle::Update(const float fDeltaTime)
{
	// タイトルマネージャーの更新
	assert(m_pTitleManager != nullptr);
	m_pTitleManager->Update(fDeltaTime);

	// シーンの更新
	CScene::Update(fDeltaTime);
}

//============================================================
//	タイトルマネージャー取得処理
//============================================================
CTitleManager *CSceneTitle::GetTitleManager(void)
{
	// インスタンス未使用
	assert(m_pTitleManager != nullptr);

	// タイトルマネージャーを返す
	return m_pTitleManager;
}
