//============================================================
//
//	スクリーンヘッダー [screen.h]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	二重インクルード防止
//************************************************************
#ifndef _SCREEN_H_
#define _SCREEN_H_

//************************************************************
//	インクルードファイル
//************************************************************
#include "object2D.h"

//************************************************************
//	クラス定義
//************************************************************
// スクリーンクラス
class CScreen : public CObject2D
{
public:
	// コンストラクタ
	CScreen();

	// デストラクタ
	~CScreen();

	// オーバーライド関数
	HRESULT Init(void) override;	// 初期化
	void Uninit(void) override;		// 終了
	void Update(const float fDeltaTime) override;	// 更新
	void Draw(CShader *pShader = nullptr) override;	// 描画

	// 静的メンバ関数
	static CScreen *Create(const int nScreenTexID);	// 生成
};

#endif	// _SCREEN_H_
